nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1152/common/pin_mux/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCANPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: V17, peripheral: CAN2, signal: TX, pin_signal: GPIO_AD_00}
  - {pin_num: AA23, peripheral: CAN2, signal: RX, pin_signal: GPIO_AD_01}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCANPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCANPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_00_FLEXCAN2_TX,          /* GPIO_AD_00 is configured as FLEXCAN2_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_01_FLEXCAN2_RX,          /* GPIO_AD_01 is configured as FLEXCAN2_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitENCPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: B6, peripheral: XBARA1, signal: 'IN, 04', pin_signal: GPIO_EMC_B1_12, software_input_on: Enable}
  - {pin_num: C3, peripheral: XBARA1, signal: 'IN, 05', pin_signal: GPIO_EMC_B1_13, software_input_on: Enable}
  - {pin_num: A5, peripheral: XBARA1, signal: 'IN, 06', pin_signal: GPIO_EMC_B1_14, software_input_on: Enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitENCPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitENCPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_12_XBAR1_INOUT04,    /* GPIO_EMC_B1_12 is configured as XBAR1_INOUT04 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_12 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_13_XBAR1_INOUT05,    /* GPIO_EMC_B1_13 is configured as XBAR1_INOUT05 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_13 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_14_XBAR1_INOUT06,    /* GPIO_EMC_B1_14 is configured as XBAR1_INOUT06 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_14 */
  IOMUXC_GPR->GPR20 = ((IOMUXC_GPR->GPR20 &
    (~(IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_4_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_5_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_6_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_4(0x00U) /* IOMUXC XBAR_INOUT4 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_5(0x00U) /* IOMUXC XBAR_INOUT5 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_6(0x00U) /* IOMUXC XBAR_INOUT6 function direction select: 0x00U */
    );
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitENET_1GPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: L19, peripheral: ENET_1G, signal: enet_rx_en, pin_signal: GPIO_SD_B2_00, software_input_on: Disable, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: J25, peripheral: ENET_1G, signal: enet_rx_clk, pin_signal: GPIO_SD_B2_01, software_input_on: Disable, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: M24, peripheral: ENET_1G, signal: 'enet_rdata, 00', pin_signal: GPIO_SD_B2_02, software_input_on: Disable, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: J18, peripheral: ENET_1G, signal: 'enet_rdata, 01', pin_signal: GPIO_SD_B2_03, software_input_on: Disable, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: L23, peripheral: ENET_1G, signal: 'enet_rdata, 02', pin_signal: GPIO_SD_B2_04, software_input_on: Disable, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: W6, peripheral: ENET_1G, signal: 'enet_rdata, 03', pin_signal: GPIO_EMC_B2_07, software_input_on: Disable, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: F16, peripheral: ENET_1G, signal: 'enet_tdata, 03', pin_signal: GPIO_DISP_B1_06, software_input_on: Disable, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: H16, peripheral: ENET_1G, signal: 'enet_tdata, 02', pin_signal: GPIO_DISP_B1_07, software_input_on: Disable, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: B22, peripheral: ENET_1G, signal: 'enet_tdata, 01', pin_signal: GPIO_DISP_B1_08, software_input_on: Disable, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: C21, peripheral: ENET_1G, signal: 'enet_tdata, 00', pin_signal: GPIO_DISP_B1_09, software_input_on: Disable, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: A23, peripheral: ENET_1G, signal: enet_tx_en, pin_signal: GPIO_DISP_B1_10, software_input_on: Disable, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: G16, peripheral: ENET_1G, signal: enet_tx_clk_io, pin_signal: GPIO_DISP_B1_11, direction: OUTPUT, software_input_on: Disable, pull_down_pull_up_config: No_Pull,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: R3, peripheral: ENET_1G, signal: enet_mdio, pin_signal: GPIO_EMC_B1_41, software_input_on: Disable, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: R1, peripheral: ENET_1G, signal: enet_mdc, pin_signal: GPIO_EMC_B1_40, software_input_on: Disable, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: T20, peripheral: GPIO9, signal: 'gpio_io, 13', pin_signal: GPIO_AD_14, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

