nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1152/common/pin_mux/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCODEC_I2CPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: B12, peripheral: LPI2C4, signal: SCL, pin_signal: GPIO_DISP_B2_12, software_input_on: Enable, pull_keeper_select: Keeper, open_drain: Enable, drive_strength: Normal}
  - {pin_num: F11, peripheral: LPI2C4, signal: SDA, pin_signal: GPIO_DISP_B2_13, software_input_on: Enable, pull_keeper_select: Keeper, open_drain: Enable, drive_strength: Normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCODEC_I2CPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCODEC_I2CPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_12_LPI2C4_SCL,      /* GPIO_DISP_B2_12 is configured as LPI2C4_SCL */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_DISP_B2_12 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_13_LPI2C4_SDA,      /* GPIO_DISP_B2_13 is configured as LPI2C4_SDA */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_DISP_B2_13 */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_12_LPI2C4_SCL,      /* GPIO_DISP_B2_12 PAD functional properties : */
      0x10U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: normal drive strength
                                                 Pull / Keep Select Field: Pull Disable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Enabled
                                                 Domain write protection: CM7 is allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_13_LPI2C4_SDA,      /* GPIO_DISP_B2_13 PAD functional properties : */
      0x10U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: normal drive strength
                                                 Pull / Keep Select Field: Pull Disable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Enabled
                                                 Domain write protection: CM7 is allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitALT_I2CPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: AC11, peripheral: LPI2C6, signal: SDA, pin_signal: GPIO_LPSR_10, software_input_on: Enable, pull_keeper_select: Keeper, open_drain: Enable, drive_strength: High}
  - {pin_num: AE11, peripheral: LPI2C6, signal: SCL, pin_signal: GPIO_LPSR_11, software_input_on: Enable, pull_keeper_select: Keeper, open_drain: Enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitALT_I2CPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitALT_I2CPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_10_LPI2C6_SDA,         /* GPIO_LPSR_10 is configured as LPI2C6_SDA */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_10 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_11_LPI2C6_SCL,         /* GPIO_LPSR_11 is configured as LPI2C6_SCL */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_11 */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_10_LPI2C6_SDA,         /* GPIO_LPSR_10 PAD functional properties : */
      0x2AU);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull Select Field: Pull Disable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain LPSR Field: Enabled
                                                 Domain write protection: CM7 is allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_11_LPI2C6_SCL,         /* GPIO_LPSR_11 PAD functional properties : */
      0x22U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull Select Field: Pull Disable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain LPSR Field: Enabled
                                                 Domain write protection: CM7 is allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
